3dmn/RadarOS-P4/sdkconfig.defaults
# Minimalna konfiguracja ESP32-P4 + Wi-Fi 6 + LVGL + PSRAM SSL
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_300=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Koprocesor Wi-Fi 6 (ESP32-C6)
CONFIG_SLAVE_IDF_TARGET="esp32c6"
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# Odblokowanie 32MB PSRAM dla malloc i buforow systemowych
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL intentionally left unset - every
# tested override (64/128/192 KB) either starved the ESP-Hosted SDIO driver
# or the LVGL/Waveshare DSI display driver's own internal-RAM allocations
# at boot. The ESP-IDF default for this BSP is the stable, tested value.

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# SoftAP (tryb pierwszej konfiguracji / panel WWW przez wifi_manager.c)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# Alokacja mbedTLS / SSL w 32MB PSRAM
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y

# Full 16 KB inbound TLS record buffer - shrinking this to 8 KB caused
# MBEDTLS_ERR_SSL_BUFFER_TOO_SMALL (-0x7100) on ADS-B responses carrying a
# large aircraft list in a single TLS record. It is PSRAM-backed (see
# CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC/CONFIG_MBEDTLS_DYNAMIC_BUFFER above), so
# the full size does not cost internal SRAM.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP and CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY
# were tried here and removed - they conflicted with the ESP-Hosted SDIO
# driver's own buffer allocation (heap corruption) and with the LVGL/
# Waveshare DSI display driver's startup allocation. g_https_mutex (see
# wifi_manager.h) already serializes every HTTPS/TLS session in the app,
# which is what actually protects the SDIO driver's DMA buffers.

# Konfiguracja wyswietlacza LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y